const ccxt = require ('ccxt');

(async function () {

      // може да замените 'binance' с 'kraken' или нещо друго от този списък: https://github.com/ccxt/ccxt
      let x = new ccxt.binance({
        'apiKey' :'---------', // вземете ги от борсата
        'secret': '---------',
        'timeout': 30000,
        'enableRateLimit': true
      })

    
    // https://github.com/ccxt/ccxt/wiki/Manual#market-orders
    await x.createMarketBuyOrder("BTC/BUSD", 30) // BTC/BUSD - за всяка валута и борса е различна, намерете я във вашата борса
    // Втория параметър (30) е сумата на поръчката. В случая 30 BUSD долара и трябва да имате BUSD в борсата. Ако парите ви са в USDT или EUR, поръчката няма да се изпълни
 
    // Внимание: Ако държите всичко в борсата за дълго време, то този скрипт и ключа в него са опасни. Някой може да използва api ключа,
    // за да направи хиляди малки губещи за вас транзакции и така да преточи парите ви от борсата. Освен това, може и цялата борса да изчезне.
    // Решение: Периодично изваждайте парите си от борсата ръчно или автоматично и ги съхранявайте в хардуерен wallet
  
    // Може да се използва withdraw функция, за да се извади крипто валутата от борсата https://github.com/ccxt/ccxt/wiki/Manual#withdraw
  
    console.log("Done");
})()
